var foo = 1;
function bar() {
  if (!foo) {
    var foo = 10;
  }
  alert(foo);
}
bar();

/*Коли йде оголошення змінних через var, то воно піднімаються на початок функції, і оскільки змінуу ще не присвоєно, то вона буде = undefined.
Згідно правилам JS - undefined еквівалентиний false, тому умова виконується. */

var a = 1;
function b() {
  a = 10;
  return;
  /* function a() {} - через те що в нас є function під назвою а, то вираз a=10 перезаписує змінну a,
   в якій на даний момент знаходиться функція на число 10, але глобальну змінну ніяк не зачіпує,
    тому на виході ми отримуємо число змінної a.
    щоб виводилось 10, ми видалаємо function a()*/
}
b();
console.log(a);
