let x = "I`m here.\n";
let y = "Hello,\n";
let z = "How are you?\n";
console.log(y.concat(x, z));

/*Унарні оператори приймають лише один операнд:
+: Конвертує операнд у число. Наприклад, +5 дорівнює 5, а +'10' дорівнює 10.
-: Мінусує число (змінює його знак на протилежний). Наприклад, -5 дорівнює -5.
++: Інкрементує (збільшує на одиницю) значення операнду. Наприклад, якщо let x = 5;, то ++x дорівнює 6.
--: Декрементує (зменшує на одиницю) значення операнду. Наприклад, якщо let y = 10;, то --y дорівнює 9.
!: Логічне заперечення. Якщо операнд має значення true, то !operand буде false, і навпаки.

Бінарні оператори приймають два операнди, тобто вони діють на два значення. Приклади бінарних операторів:

+: Додає два числа або конкатенує два рядки. Наприклад, 5 + 10 дорівнює 15, а 'Hello' + ' World' дорівнює 'Hello World'.
-: Віднімає одне число від іншого. Наприклад, 10 - 5 дорівнює 5.
*: Множить два числа. Наприклад, 5 * 10 дорівнює 50.
/: Ділить одне число на інше. Наприклад, 10 / 2 дорівнює 5.
%: Повертає залишок від ділення одного числа на інше. Наприклад, 10 % 3 дорівнює 1.

Тернарний оператор — це коротка форма умовного виразу:
let isMember = false/true
let fee = isMember ? "$2.00" : "$10.00";
 
console.log(fee)

Також є логічні оператори(true; false), оператори присвоєння(=, +=, -=, *= ...) та ін.

*/
